; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 967674 2 1 3 5 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph2 - mode
	spectrograph0 - mode
	spectrograph1 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(have_image Phenomenon5 spectrograph1)
	(have_image Star6 spectrograph2)
	(have_image Phenomenon7 spectrograph1)
	(have_image Star8 spectrograph0)
	(have_image Star9 spectrograph0)
	(have_image Phenomenon10 spectrograph2)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
3. (turn_to satellite0 star6 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star6)
   goals met: 0 of 6
4. (turn_to satellite1 groundstation4 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 6
5. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 6
6. (turn_to satellite0 star2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
7. (turn_to satellite1 star9 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star9)
   goals met: 0 of 6
8. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 6
9. (take_image satellite1 star9 instrument1 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 1 of 6
10. (turn_to satellite0 star6 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star6)
   goals met: 1 of 6
11. (turn_to satellite1 phenomenon7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon7)
   goals met: 1 of 6
12. (take_image satellite0 star6 instrument0 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 2 of 6
13. (take_image satellite1 phenomenon7 instrument1 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 3 of 6
14. (turn_to satellite0 phenomenon10 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 6
15. (turn_to satellite1 phenomenon5 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon5)
   goals met: 3 of 6
16. (take_image satellite0 phenomenon10 instrument0 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 4 of 6
17. (take_image satellite1 phenomenon5 instrument1 spectrograph1)
   added: (have_image phenomenon5 spectrograph1)
   goals met: 5 of 6
18. (turn_to satellite1 star8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star8)
   goals met: 5 of 6
19. (take_image satellite1 star8 instrument1 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 6 of 6
